#+TITLE: Organizujte se
#+AUTHOR: Kepi
#+DATE: 2018-11-03
#+SETUPFILE: ../themes/igloonet_solarized.setup
#+OPTIONS: reveal_title_slide:"<h2>%t</h2><h3>v&nbsp;Org&nbsp;mode</h3><h4>%a</h4><p>3.&nbsp;11.&nbsp;2018&nbsp;v&nbsp;10&nbsp;hod</p><p>#openalt</p>"
#+REVEAL_TITLE_SLIDE_BACKGROUND: data/b9/a596d3-2697-4a42-8aa8-6221b0e6ccb3/org.png
#+REVEAL_TITLE_SLIDE_BACKGROUND_OPACITY: 0

** Org babel
:PROPERTIES:
:CUSTOM_ID: h-4d8d906e-75f6-4213-af47-04b9636a8e52
:END:

#+BEGIN_smaller
Jako poslední ten naprosto nejdůležitější, alespoň pro mě :) Používání kódu z různých programovacíh jazyků přímo z Org mode.
#+END_smaller

#+BEGIN_EXAMPLE
#+BEGIN_SRC http :pretty
GET http://wttr.in/Brno?T0
#+END_SRC

#+RESULTS:
: Weather report: Brno, Czech Republic
: 
:     \  /       Partly cloudy
:   _ /"".-.     14 °C          
:     \_(   ).   ← 6 km/h       
:     /(___(__)  20 km          
:                0.0 mm         
#+END_EXAMPLE

